
[
  {
    "id": "1",
    "publish": true,
    "date": "2025-06-03",
    "category": "General",
    "tags": ["한국어", "web-design", "minimalism"],
    "title": {
      "en": "Minimalist Web Design is Hard",
      "ko": "미니멀한 웹 디자인은 어렵다"
    },
    "content": {
      "en": "<p>The initial design concepts I had for this blog were simple (trying to keep it minimalist, I thought). I wanted to design mobile-first (designing the layout for a mobile device originally and then modifying it for larger devices and computers later), keep it monochrome, play with negative space, and make it typography-centric. This, I thought, was the basis of minimalist web design. But when it got to actually displaying the content I wanted to share, I realized I also had to decide how to only use what was necessary.</p><p>Here are the core ideas I gathered from various blogs<sup data-fn='1'></sup> and videos that made the most sense to me:</p><ul><li>Use flat patterns and features</li><li>Arrange text content in blocks</li><li>Use monochromatic color palettes with a bright color and ensure contrast is good</li><li>Use whitespace or negative space between content (Can be difficult with mobile web design because space is limited)</li><li>Create interest with a font</li><li>Limit content, but think about the basic actions a user will still want to do at any point</li></ul><p>And these are the websites/layouts I used the most for inspirational elements:</p><a href='https://www.builtforarchives.com/' target='_blank'>builtforarchives.com</a><br><a href='https://www.pizzatoits.it/?ref=lapaninja' target='_blank'>pizzatoits.it</a><br><a href='https://developments.media/?ref=lapaninja' target='_blank'>developments.media</a><br><a href='https://johannadarrieta.com/' target='_blank'>johannadarrieta.com</a><br><a href='https://www.linkdeco.com/artist/sophia-bratt/' target='_blank'>linkdeco.com / Sophia Bratt</a><br><a href='https://preview.studio.site/templates/14BqN41WrP/portfolio/05' target='_blank'>preview.studio.site / Portfolio</a><br><a href='https://www.alt-border.com/projects/starface-skincare' target='_blank'>alt-border.com</a><br><a href='https://inette.co/' target='_blank'>inette.co</a><br><a href='https://www.davidebaratta.com/' target='_blank'>davidebaratta.com</a><br>",
      "ko": "<p>이 블로그를 위한 초기 디자인 컨셉은 단순했어요 (미니멀리즘을 지키고 싶었거든요). 모바일 우선으로 디자인하고 싶었고(처음에는 모바일 기기에 맞춰 레이아웃을 짠 뒤 나중에 큰 화면에 맞게 수정하는 방식), 색상은 모노톤으로 유지하고, 여백을 적극적으로 활용하고, 타이포그래피 중심으로 만들고 싶었어요. 이런 요소들이 미니멀한 웹디자인의 기본이라고 생각했죠. 하지만 실제로 공유하고 싶은 콘텐츠를 화면에 어떻게 보여줄지 고민하기 시작하면서, 필요한 것만 쓰는 방식에 대해서도 깊이 생각하게 됐어요.</p> <p>아래는 여러 블로그<sup data-fn='1'></sup>와 영상들에서 참고한 아이디어 중 저에게 가장 와닿았던 핵심 내용들이에요:</p> <ul> <li>플랫한 패턴과 기능 사용하기</li> <li>텍스트 콘텐츠를 블록 단위로 정렬하기</li> <li>모노톤 컬러 팔레트에 포인트 컬러를 하나 더해 대비를 잘 주기</li> <li>콘텐츠 사이에는 여백(negative space)을 활용하기 (모바일 웹 디자인에서는 화면이 좁아서 어렵게 느껴질 수 있음)</li> <li>폰트로 시각적 흥미 주기</li> <li>콘텐츠는 최소화하되, 사용자가 언제든 하고 싶을 만한 기본적인 행동은 고려하기</li> </ul> <p>그리고 아래는 제가 가장 많이 참고했던 웹사이트와 레이아웃들이에요:</p><a href='https://www.builtforarchives.com/' target='_blank'>builtforarchives.com</a><br><a href='https://www.pizzatoits.it/?ref=lapaninja' target='_blank'>pizzatoits.it</a><br><a href='https://developments.media/?ref=lapaninja' target='_blank'>developments.media</a><br><a href='https://johannadarrieta.com/' target='_blank'>johannadarrieta.com</a><br><a href='https://www.linkdeco.com/artist/sophia-bratt/' target='_blank'>linkdeco.com / Sophia Bratt</a><br><a href='https://preview.studio.site/templates/14BqN41WrP/portfolio/05' target='_blank'>preview.studio.site / Portfolio</a><br><a href='https://www.alt-border.com/projects/starface-skincare' target='_blank'>alt-border.com</a><br><a href='https://inette.co/' target='_blank'>inette.co</a><br><a href='https://www.davidebaratta.com/' target='_blank'>davidebaratta.com</a><br>"
    },
    "imageUrl": "",
    "footnotes": [
        "<a href='https://medium.com/@abenezerdaniel147/the-complete-guide-to-monochromatic-web-designs-1670dd903738' target='_blank'>https://medium.com/@abenezerdaniel147/the-complete-guide-to-monochromatic-web-designs-1670dd903738</a><br><a href='https://www.webnode.com/blog/principles-for-minimalism-in-web-design/' target='_blank'>https://www.webnode.com/blog/principles-for-minimalism-in-web-design/</a><br><a href='https://sage.agency/blog/web-design-mobile-best-practices/' target='_blank'>https://sage.agency/blog/web-design-mobile-best-practices/</a>"
    ]
  },
  {
    "id": "2",
    "publish": true,
    "date": "2025-06-03",
    "category": "Thoughts",
    "tags": ["한국어", "mental-health", "thoughts"],
    "title": {
      "en": "May – Mental Health Month",
      "ko": "5월은 정신 건강의 달"
    },
    "content": {
      "en": "<p>I had intended to finish creating the website for my blog during the month of May and, since May is Mental Health Month, write a few blog posts about mental health. Especially because mental health is still a fairly taboo topic in South Korea, I thought that a few posts in Korean—even if poorly written and on an unpopular blog—might still be worthwhile for someone.</p><p>While I didn’t finish the blog in May, no that it is finished I plan to post a few things about mental health. Specifically, I want to talk about my own struggles, what I’ve learned through research, and how I’ve worked to cope with those challenges. My first mental health post will come after this one. For all future posts on the topic, I’ll make sure to add the “mental health” tag.</p><p>(As of writing this post, I haven’t completed the tag feature yet—QQ)</p>",
      "ko": "<p>5월 한 달 동안 블로그 웹사이트를 완성하고, 5월이 정신 건강의 달이기도 하니 정신 건강에 대한 글을 몇 편 써야겠다고 생각했어요. 특히 한국에서는 아직 정신 건강이라는 주제가 꽤나 금기시되는 편이라, 비록 잘 쓰이지 않은 블로그에 서툰 한국어로 쓴 글일지라도, 누군가에게는 의미가 있을 수도 있겠다고 생각했어요.</p> <p>결국 5월 안에 블로그를 완성하지는 못했지만, 이제 완성된 만큼 정신 건강에 대한 글을 몇 개 올릴 계획이에요. 주로 제가 겪은 어려움, 그와 관련해 조사하면서 배운 점들, 그리고 그 문제들을 어떻게 극복하려 했는지에 대한 이야기를 나누고 싶어요. 정신 건강에 관한 첫 번째 글은 이 글 다음에 올라올 예정이에요. 이후 이 주제로 쓰는 글들에는 모두 'mental-health' 태그를 붙일 예정이에요.</p> <p>(이 글을 쓰는 시점에서는 아직 태그 기능이 완성되지 않았어요—ㅠㅠ)</p>"
    },
    "imageUrl": "../public/images/IMG_8791.JPG",
    "footnotes": []
  },
  {
    "id": "3",
    "publish": true,
    "date": "2025-05-17",
    "category": "Thoughts",
    "tags": ["한국어", "mental-health", "thoughts"],
    "title": {
      "en": "Calm and Occasionally Funny",
      "ko": "차분한데 가끔 웃겨요"
    },
    "content": {
      "en": "<p>I think I'm a chill person; most would say quiet. Sometimes I think that makes people uncomfortable. Maybe it's an uneasiness about being themselves with me—or maybe my vibe is a bit strange.</p><p>When I was younger (and sometimes even now), being surrounded by people who just seemed more carefree and energetic than me made me feel like I was *indeed* strange. I couldn’t understand where people got their energy from. For me, that kind of energy only comes in spurts—when I’m really really happy, or when I’m really really any kind of emotion. I’ve tried to turn on that “energy” more consistently, but it feels fake and becomes completely exhausting.</p><p>As I’ve gotten older, I’ve just wanted to be the calm, cool person who can be surprisingly fun and witty at moments you might not expect. Over several years, as I started leaning into being myself, I began to occasionally hear from people that they appreciate my 'even temperament' (a kind and poetic direct quote that makes me happy to think about). They said that being around me felt calming, or that they didn’t feel like they had to be “on” all the time. And that they didn’t feel judged for their own vibe or behavior when they were around me. The opposite of what I’d always thought before.</p><p>It’s with those people that I realized I feel that 'energy' more often. I talk and joke around more with them—maybe because they give me the same sense of ease: that I don’t have to be “on” all the time, and my quietness isn’t being judged. In a way, it’s kind of ironic—the people who don’t expect a lot of energy from me are the ones I can actually share the most of it with. When I think about building connections, I realize the best ones I’ve had haven’t been about trying to match someone’s energy, but about appreciating the energy they naturally bring. If we follow that mindset, I think we can connect with anyone—at least in theory.</p>",
      "ko": "<p>저는 제가 꽤 차분한 사람이라고 생각해요. 대부분은 조용한 편이라고 말하죠. 그런데 가끔은 그런 제 모습이 다른 사람들을 불편하게 만드는 것 같다는 생각이 들어요. 아마 저와 함께 있을 때 자기 자신을 자연스럽게 드러내는 게 어려운 건지, 아니면 제 분위기가 조금 낯설게 느껴지는 건지도 모르겠어요.</p><p>어릴 때 (그리고 지금도 가끔은), 저보다 훨씬 더 자유롭고 활기차 보이는 사람들 사이에 있을 때면 내가 정말 이상한 사람인 것처럼 느껴졌어요. 도대체 그 에너지가 어디서 나오는 건지 이해할 수 없었거든요. 저한테 그런 에너지는 정말 기분이 _진짜_ 좋거나, 아니면 _진짜_ 어떤 감정이 강하게 느껴질 때 잠깐씩 나와요. 그 에너지를 꾸준히 끌어내 보려고 한 적도 있지만, 그건 너무 가식처럼 느껴졌고 완전히 기진맥진해졌어요.</p><p>나이가 들수록, 예상하지 못한 순간에 살짝 재치 있고 재미있는, 그런 차분하고 쿨한 사람이 되고 싶다는 생각을 하게 됐어요. 몇 년 동안 조금씩 제 모습 그대로 살아가 보니까, 어느 순간부터 어떤 분들이 제 “평온한 기질”이 좋다고 말해주기 시작했어요 (지금 생각해도 참 고맙고 시적인 표현이에요). 그분들은 저랑 있으면 마음이 편해졌다고, 굳이 늘 에너지 넘치게 행동할 필요가 없었다고 하셨어요. 자기 분위기나 행동이 평가받는 느낌도 들지 않았다고 하시더라고요. 예전의 제가 가졌던 생각과는 전혀 다른 얘기였어요.</p><p>그런 사람들과 함께 있을 때, 저도 “에너지”를 더 자주 느끼게 되는 것 같아요. 말도 더 많이 하게 되고, 장난도 많이 치게 돼요. 아마 저도 그분들 덕분에 편안함을 느끼기 때문이겠죠. 굳이 활기찬 척하지 않아도 괜찮고, 제가 조용하다고 이상하게 보지 않으니까요. 아이러니하게도, 저에게 많은 에너지를 기대하지 않는 사람들이 오히려 제가 에너지를 가장 많이 나눌 수 있는 사람들이더라고요. 관계에 대해 생각해보면, 제가 가장 좋았다고 느꼈던 관계들은 상대의 에너지를 억지로 따라가려 하기보다는, 그 사람이 가진 에너지를 있는 그대로 존중했을 때였어요. 그런 마음으로 다가간다면, 누구와도 연결될 수 있지 않을까 싶어요—적어도 이론적으로는요.</p>"
    },
    "imageUrl": "../public/images/IMG_9663.JPG",
    "footnotes": []
  },
  {
    "id": "4",
    "publish": false,
    "date": "2025-05-17",
    "category": "Thoughts",
    "tags": ["travel", "thoughts"],
    "title": {
      "en": "A Trial, A Test",
      "ko": "시련과 시험"
    },
    "content": {
      "en": "<p>I wanted my first blog post to be more thoughtful. But mostly I just want to get the blog online. So here it is, thoughtless and without meaning and will be promptly deleted when I have something better to replace it with. (Hopefully quickly.)</p>",
      "ko": "<p>처음 글은 좀 더 의미 있고 진지하게 쓰고 싶었는데, 솔직히 지금은 그냥 블로그를 일단 올리는 게 목표예요. 그래서 올립니다. 별 생각 없이, 별 의미도 없이. 조만간 더 나은 걸로 바꾸면 바로 지울 예정이에요. (부디 빨리.)</p>"
    },
    "imageUrl": "../public/images/firstPostDummy.JPG",
    "footnotes": []
  },
  {
    "id": "5",
    "publish": false,
    "date": "2025-05-17",
    "category": "Thoughts",
    "tags": ["travel", "thoughts"],
    "title": {
      "en": "A Trial, A Test",
      "ko": "시련과 시험"
    },
    "content": {
      "en": "<p>I wanted my first blog post to be more thoughtful. But mostly I just want to get the blog online. So here it is, thoughtless and without meaning and will be promptly deleted when I have something better to replace it with. (Hopefully quickly.)</p>",
      "ko": "<p>처음 글은 좀 더 의미 있고 진지하게 쓰고 싶었는데, 솔직히 지금은 그냥 블로그를 일단 올리는 게 목표예요. 그래서 올립니다. 별 생각 없이, 별 의미도 없이. 조만간 더 나은 걸로 바꾸면 바로 지울 예정이에요. (부디 빨리.)</p>"
    },
    "imageUrl": "../public/images/firstPostDummy.JPG",
    "footnotes": []
  }

]